{
  "date": "2020-05-31T15:50:56.401Z",
  "title": "Give... Gardening a Chance?",
  "body": "### How it All Started\n\nHello wonderful people of the Q era,\n\nI don't know about you, but these 3 months of quarantine have been ***ROUGH***. Preoccupations with work and school were my coping mechanism and distractions, but we all know that denial of your current state of mental health can last for just so long. \n\nExperiencing all spheres of your life like work meetings, school classes, workout sessions (while they lasted) and social interactions with loved ones (virtually, of course) within the same four walls is truly an interesting and lonely experience. Even with all the effort I put in to stay connected, I felt nothing but disconnect.\n\n***So***, as you can see, this was the perfect recipe for a mental breakdown and we all need a little pick-me up after one of those. In addition, I needed some structure and was ready for a new responsibility in my life. Also, by looking at the bright side of Q, I had a lot more time on my hands since I was ***ALWAYS HOME*** (luckily, social distancing rules are starting to loosen up). Therefore, I decided I wanted to focus my energy on giving love and attention to something I can make flourish and grow: a garden!\n\n### Q Slumps Make Green Thumbs\n\nEven before doing some \"formal research\" (i.e. Google-ing and YouTube-ing how to plant a garden) I already had an idea of what I wanted to plant. It started off by just looking to grow herbs, but with the convincing of sister dearest, veggies were added to the list. In no particular order, the plants chosen were: \n\n* Oregano\n* Thyme\n* Chives\n* Dill\n* Rosemary\n* Chamomile\n* Lavender\n* Cherry tomatoes (red and orange)\n* Yellow bell peppers\n* Cucumbers\n\nNext, I spent some time (45 min) before going to the pépinière to figure out what I actually needed to grow these plants successfully. I watched the first video result that came up from my Google search, which is linked below: \n\n<https://youtu.be/HAL2sCXNXpU>\n\nKey learnings from my sophisticated research were:\n\n* You can grow most plants in containers; just make sure that they have wholes at the base for water drainage (R.I.P. to all the cute pots you find).\n* You can combine more than one plant in a container if it is large enough and if the plants are not aggressive. Plant aggressiveness means the extent to which the root system will expand and take over the entire container or garden if you are planting in the ground. For example, best to plant mint alone or with other mint plants since it is an invasive one.\n* I found this out later on in the game, but if your plants are perennial best to plant them in the ground since they will grow back every year (could've done this for practically all the herbs other than the dill... oops).\n* For beginners, there's no need to break your head on making your custom soil with precise ratios of Nitrogen:Phosphorus:Potassium. By all means, if you want to go there, all power to you, but buying some Pro-Mix soil and fertilizer is good enough; depending on the size of the pot, 1-4 tbsp of fertilizer will do.\n* There's no clear answer on how often to water plants (weird, right?!). But with expert advice from my dad, I decided I would water them for 2 days on and 1 day off as long as long as the soil was still wet and moist. Just like dry and cracked lips, no one likes dry and cracked soil!\n\nOnce all the plants were bought, along with a mini statue of Buddha to give blessing, the potting process went pretty smoothly. Below are the final results of the garden!\n\n![Cherry tomatoes, oregano, thyme, dill, chives, containers](/img/20885055-9797-41b0-a611-a277e666e3d0.jpeg \"Garden part 1\")\n\n![chamomile, lavender, plants, Buddha, statue, pot](/img/c78239cb-da52-495e-a5ac-89b92f79c84a.jpg \"Garden part 2\")\n\n![pot, plant, bell pepper, rosemary, cucumbers](/img/2c6ac2ca-3e14-4b6e-9651-831c0e12b597.jpg \"Garden part 3\")\n\n### One Week Later...\n\nOne week has passed and the plants are alive, thriving and standing up taller than before! To avoid being one of those annoying moms on social media posting pictures of their newborn on the daily (even though I will totally be that mom in the future), I will refrain from showing you too many progress pictures for this week and just the highlights: \n\nThe bell pepper plant is starting to get little bulbs!\n\n![bell pepper, plant, bulb](/img/img_7674.jpg \"Bell Pepper Bulb\")\n\nThe cucumber plant has ***DOUBLED*** in size!\n\n![cucumber, plant, pot](/img/img_7671.jpg \"Cucumber plant\")\n\nThe oregano and dill are getting ***PLUMP***!\n\n![herbs, plants, oregano, dill, chives, time](/img/img_7678.jpg \"Herbs\")\n\n### Next Steps\n\nNow that the plants got their dose of sunlight from the extremely hot weather we had in Montreal this past week, we will see what the chilly and rainy next couple of days will bring. I realize I sound overly dramatic, as if Winter is coming, but I'm a first time gardener OK!\n\nSince the plants will be watered by nature for some time, my next phase is to research not only how to harvest the vegetables but the herbs, since what is known as \"flowering\" can alter their taste?\n\nGame on.",
  "description": "In our current situation, where quanrantine can not only get lonely but also cause some of us to get preoccupied with work, finding a hobby and putting our energy into something fulfilling can help ease tension and create a routine. Join me on my journey as a first time gardener!"
}